# Setup
This is a quick tutorial on how to join two different CSV/Excel files using Python and Pandas DataFrame. This method can oftentimes be quicker than Excel forumlas or scripting.

In [14]:
import pandas as pd
from pandas import DataFrame

### Note first entry is dated 1/13/16

In [17]:
# Display content of first CSV file
df_close = DataFrame(pd.read_csv('data/amzn_close.csv'))
df_close

      Date Ticker   Close
0  1/13/16   AMZN  724.92
1  1/14/16   AMZN  770.24
2  1/15/16   AMZN  716.52
3  1/16/16   AMZN  783.79
4  1/17/16   AMZN  710.68
5  1/18/16   AMZN  798.79

### Note last entry is dated 1/19/16 and also records are sorted in reverse order

In [18]:
# Display content of second CSV file
df_vol = DataFrame(pd.read_csv('data/amzn_vol.csv'))
df_vol

      Date Ticker     Volume
0  1/19/16   AMZN    821,581
1  1/18/16   AMZN  1,934,581
2  1/17/16   AMZN  8,601,054
3  1/16/16   AMZN    844,660
4  1/15/16   AMZN  9,697,179
5  1/14/16   AMZN  4,559,879

## Correct Methods

In [39]:
# only include rows that exist in both tables
df_close.merge(df_vol, how='inner')

      Date Ticker   Close     Volume
0  1/14/16   AMZN  770.24  4,559,879
1  1/15/16   AMZN  716.52  9,697,179
2  1/16/16   AMZN  783.79    844,660
3  1/17/16   AMZN  710.68  8,601,054
4  1/18/16   AMZN  798.79  1,934,581

In [42]:
# including both ends
df_close_vol = df_close.merge(df_vol, how='outer')
df_close_vol

      Date Ticker   Close     Volume
0  1/13/16   AMZN  724.92        NaN
1  1/14/16   AMZN  770.24  4,559,879
2  1/15/16   AMZN  716.52  9,697,179
3  1/16/16   AMZN  783.79    844,660
4  1/17/16   AMZN  710.68  8,601,054
5  1/18/16   AMZN  798.79  1,934,581
6  1/19/16   AMZN     NaN    821,581

In [48]:
# sort by desecnding dates
df_close_vol.sort_index(ascending=False)

      Date Ticker   Close     Volume
6  1/19/16   AMZN     NaN    821,581
5  1/18/16   AMZN  798.79  1,934,581
4  1/17/16   AMZN  710.68  8,601,054
3  1/16/16   AMZN  783.79    844,660
2  1/15/16   AMZN  716.52  9,697,179
1  1/14/16   AMZN  770.24  4,559,879
0  1/13/16   AMZN  724.92        NaN

## Incorrect Methods
These methods may sound correct at first but do not yield the expected results.

In [28]:
#deliberately showing wrong operation
df_close + df_vol

   Close            Date    Ticker Volume
0    NaN  1/13/161/14/16  AMZNAMZN    NaN
1    NaN  1/14/161/15/16  AMZNAMZN    NaN
2    NaN  1/15/161/16/16  AMZNAMZN    NaN
3    NaN  1/16/161/17/16  AMZNAMZN    NaN
4    NaN  1/17/161/18/16  AMZNAMZN    NaN
5    NaN  1/18/161/19/16  AMZNAMZN    NaN

In [29]:
# simply stacking them vertically
pd.concat([df_close, df_vol])

    Close     Date Ticker     Volume
0  724.92  1/13/16   AMZN        NaN
1  770.24  1/14/16   AMZN        NaN
2  716.52  1/15/16   AMZN        NaN
3  783.79  1/16/16   AMZN        NaN
4  710.68  1/17/16   AMZN        NaN
5  798.79  1/18/16   AMZN        NaN
0     NaN  1/14/16   AMZN  4,559,879
1     NaN  1/15/16   AMZN  9,697,179
2     NaN  1/16/16   AMZN    844,660
3     NaN  1/17/16   AMZN  8,601,054
4     NaN  1/18/16   AMZN  1,934,581
5     NaN  1/19/16   AMZN    821,581